{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2017, 2020)",
        "GPA: 3.94/4.30"
      ],
      "degree": "Bachelor of Computer Sciences",
      "department": "Gina Cody School of Engineering and Computer Engineering",
      "duration": "2017-2021",
      "school_name": "Concordia University, Montreal, QC"
    },
    {
      "awards_achievements": null,
      "degree": "Master of Engineering - Power Electronics and Power Drives",
      "department": "School of Electric Power",
      "duration": "2010-2013",
      "school_name": "South China University of Technology, Guangzhou, China"
    },
    {
      "awards_achievements": [
        "National Scholarship (2007), The First Prize Scholarship (2007, 2008), The Second Prize Scholarship (2009)"
      ],
      "degree": "Bachelor of Engineering ? Electrical Engineering and Automation",
      "department": "College of Electrical and Information Engineering",
      "duration": "2006-2010",
      "school_name": "Hunan University, Changsha, China"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_JesseZhang",
  "highlighted_projects": [
    {
      "description": "Designed and implemented a compiler for a simple programming language: built a scanner based on given lexical specifications; built a syntactic analyzer for the language specified by the grammar; implemented a semantic analyzer using the visitor pattern; implemented a code generation phase. Technologies: Java, Maven, UNIX, C, Git, dot, Jsoup.",
      "git_url": "https://github.com/natsumeqi/COMP442-compiler-design",
      "name": "Compiler design"
    },
    {
      "description": "Implemented RESTful API for the business function. Technologies: Java, Maven, SQLite, JAR-RS(Jersey), Vue, Git, Postman, Curl, JSON.",
      "git_url": "https://github.com/Tianxiang-Concordia/SOEN487Project2",
      "name": "Secure Library Book Reservation System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Collect the hardware specifications and monitor host resource usages in real-time, two bash scripts are run and the extracted records are inserted into a PostgreSQL database which is provisioned by Docker. The setup of the database is also automated by running a bash script. SQL queries are implemented to process the records in the database.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Jesse Zhang",
  "others": [
    {
      "bullets": [
        ".."
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        ".."
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Bicycling",
        "Volunteer for Generations, The Yellow Door, Montreal, QC (Jun 2018-Aug 2021): visiting the seniors in the downtown Montreal area once a week"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Implemented cluster monitor project..................................................................................................................",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Ericsson, Montreal, QC",
      "description": "Worked with one production team including design, development, maintenance and innovation; added and modified more than 5000 lines of codes for test cases, keeping the coverages on two back-end projects above 90%; technologies: Spring, Java, JUnit, Mockito, PowerMock, SonarQube, Git Bash, Gerrit, MongoDB, PostgreSQL.",
      "duration": "Sep 2019-Dec 2019",
      "title": "Software Developer Co-op"
    },
    {
      "company": "NetGovern, Montreal, QC",
      "description": "Participated in two sprints of testing, including functional, integration and regression tests using Jira, RQM and VMWare; completed annotations tasks for the training data in the first stage of machine learning; wrote scripts in shell scripts and Python on Linux for better annotations, such as duplicate files checking, duplicate or similar content checking, statistics (counting the numbers of entities, types and documents) and comparison (ensure consistency); implemented test cases of model training on AWS and Azure.",
      "duration": "Sep 2018-Dec 2018",
      "title": "Artificial Intelligence and Quality Assurance Intern"
    }
  ],
  "skills": {
    "competent": [
      "JavaScript",
      "HTML/CSS",
      "IntelliJ",
      "Spring",
      "Vim"
    ],
    "familiar": [
      "Python",
      "React",
      "Docker",
      "C++",
      "PHP"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am Yanqi Jesse Zhang, who graduated from Concordia University with a major in Computer Science. Before the study at Concordia, I also had an academic background in electrical engineering and experience in the industry of electric design. Having a deep interest in being a lifelong learner, I found that being a good software developer can provide me with great opportunities to learn and apply new technologies, especially to make connections between theory and practice and to contribute to an organization at the same time."
}
